ENVIRONMENT DIVISION.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
* Nombre del archivo.
SELECT [OPTIONAL].
* Tipo de dispositivo.
ASSIGN TO.
* Tipo de organización.
ORGANIZATION IS.
* Modo de acceso al archivo.
ACCESS MODE IS.
* Clave del registro.
RECORD KEY IS.
* Claves alternativas del registro.
ALTERNATE RECORD KEY IS.
* Tipo de dispositivo.
WITH DUPLICATES.
* Variable de estado del archivo.
FILE STATUS IS.
