       IDENTIFICATION DIVISION.
       PROGRAM-ID. START-1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       COPY "FISICAL-FILE.COB".
       DATA DIVISION.
       FILE SECTION.

       COPY "LOGICAL-FILE.COB".

       WORKING-STORAGE SECTION.
       01  ESTADO.
            03  OPS-EMPLEADOS               PIC X(1)  VALUE "0".
                88 MAS-EMPLEADOS                      VALUE "0".
                88 EXISTE-EMPLEADOS                   VALUE "0".
                88 NO-MAS-EMPLEADOS                   VALUE "1".
                88 NO-HAY-REGISTROS                   VALUE "2".
                88 CLAVE-DUPLICADA-EMPLEADOS          VALUE "2".
            03  FILLER                      PIC X(1).
       01  CONFIRMACION                     PIC X.
           88 S-CONFIRMACION VALUE "S".
           88 N-CONFORMACION VALUE "N".
       01  NO-HAY-DATOS                    PIC X    VALUE SPACE.
       01  ERROR-01                        PIC X    VALUE SPACE.
       01  WS-CODIGO-EMPLEADO              PIC 9(6) VALUE ZERO.
       PROCEDURE DIVISION.
       0000-MAIN-PROCEDURE.
           PERFORM 0020-ABRIR-ARCHIVO.
           MOVE "S" TO CONFIRMACION.
           PERFORM 0030-OBTENER-REGISTROS
           THRU 0030-END-OBTENER-REGISTROS
                    UNTIL WS-CODIGO-EMPLEADO = 999999.
           PERFORM 0020-CERRAR-ARCHIVO.

       0030-OBTENER-REGISTROS.
           MOVE "S" TO CONFIRMACION.
           DISPLAY "DIGITE CODIGO DE EMPLEADO...999999 PARA TERMINAR? "
           ACCEPT WS-CODIGO-EMPLEADO.
           IF WS-CODIGO-EMPLEADO = 999999
                PERFORM 0020-CERRAR-ARCHIVO
                STOP RUN.

           MOVE WS-CODIGO-EMPLEADO TO EMPLEADO-ID.
           PERFORM 0070-LEER-OBTENER-ERROR.

           PERFORM 0040-MOSTRAR-DATOS THRU 0040-END-MOSTRAR-DATOS
            UNTIL N-CONFORMACION
            OR NO-MAS-EMPLEADOS
            OR NO-HAY-REGISTROS.

       0030-END-OBTENER-REGISTROS.
       0040-MOSTRAR-DATOS.
           INITIALIZE EMPLEADO-REGISTRO.
           PERFORM 0060-READ-NEXT.

           IF NO-MAS-EMPLEADOS
              GO TO 0040-END-MOSTRAR-DATOS.

           DISPLAY "CODIGO EMPLEADO : " EMPLEADO-ID .
           DISPLAY "NOMBRE EMPLEADO : " EMPLEADO-NOMBRE .
           DISPLAY "APELLIDOS       : " EMPLEADO-APELLIDOS.
           DISPLAY "CEDULA          : " EMPLEADO-CEDULA.
           DISPLAY "EDAD            : " EMPLEADO-EDAD.
           DISPLAY "TELEFONO        : " EMPLEADO-TELEFONO.
           DISPLAY "DIRECCION       : " EMPLEADO-DIRECCION.

           MOVE SPACE TO CONFIRMACION.
           PERFORM 0050-CLAUSULA-IF THRU 0050-END-CLAUSULA-IF
           UNTIL CONFIRMACION = "S" OR  CONFIRMACION = "N" .


       0040-END-MOSTRAR-DATOS.
       0050-CLAUSULA-IF.
           DISPLAY "CONTINUAR S/N ".
           ACCEPT CONFIRMACION.

           IF CONFIRMACION = "S"
              MOVE "S" TO CONFIRMACION.

           IF CONFIRMACION = "N"
              MOVE "N" TO CONFIRMACION.

           IF CONFIRMACION = "S" OR   CONFIRMACION = "N"
               THEN GO TO 0050-END-CLAUSULA-IF.

           DISPLAY "OPCION INCORRECTA PULSE ALGO PARA CONTINUAR "
           MOVE   SPACE TO CONFIRMACION.
           ACCEPT CONFIRMACION.

       0050-END-CLAUSULA-IF.
       0060-READ-NEXT.
           READ EMPLEADOS-ARCHIVO
                NEXT AT END
                DISPLAY  "NO HAY MAS DATOS EN EL ARCHIVO".
       0060-END-READ-NEXT.
       0070-LEER-OBTENER-ERROR.
           START EMPLEADOS-ARCHIVO
              KEY IS NOT LESS EMPLEADO-ID
              INVALID KEY MOVE "S"  TO NO-HAY-DATOS
              DISPLAY "NO HAY DATOS"
           IF ESTADO NOT = ZEROS
            IF ESTADO = 23
                  MOVE "S" TO NO-HAY-DATOS
               ELSE
                  DISPLAY "ERROR"
                  MOVE "S"   TO ERROR-01
                  MOVE "S"   TO NO-HAY-DATOS
               END-IF
           END-IF.
       0070-END-LEER-OBTENER-ER.
       0020-ABRIR-ARCHIVO.
           OPEN INPUT EMPLEADOS-ARCHIVO.
       0020-END-ABRIR-ARCHIVO.

       0020-CERRAR-ARCHIVO.
           CLOSE EMPLEADOS-ARCHIVO.
       0020-END-CERRAR-ARCHIVO.

       0000-END-MAIN-PROCEDURE.
       END PROGRAM START-1.
